using System;

namespace SystemBase
{
    #region public enum EditMode
    
    /// --------------------------------------------------
    /// <summary>
    /// 画面の編集モード
    /// </summary>
    /// <create>Y.Higuchi 2010/01/20</create>
    /// <update></update>
    /// --------------------------------------------------
    public enum EditMode
    {
        /// --------------------------------------------------
        /// <summary>
        /// 指定なし
        /// </summary>
        /// <create>Y.Higuchi 2010/05/07</create>
        /// <update></update>
        /// --------------------------------------------------
        None = 0,

        /// --------------------------------------------------
        /// <summary>
        /// 登録
        /// </summary>
        /// <create>Y.Higuchi 2010/05/07</create>
        /// <update></update>
        /// --------------------------------------------------
        Insert = 1,

        /// --------------------------------------------------
        /// <summary>
        /// 修正
        /// </summary>
        /// <create>Y.Higuchi 2010/05/07</create>
        /// <update></update>
        /// --------------------------------------------------
        Update = 2,

        /// --------------------------------------------------
        /// <summary>
        /// 削除
        /// </summary>
        /// <create>Y.Higuchi 2010/05/07</create>
        /// <update></update>
        /// --------------------------------------------------
        Delete = 3,

        /// --------------------------------------------------
        /// <summary>
        /// 照会
        /// </summary>
        /// <create>Y.Higuchi 2010/05/07</create>
        /// <update></update>
        /// --------------------------------------------------
        View = 4,
    }

    #endregion

}
